app/controllers/relationships_controller.rb

  def create
    respond_to do |format|
      if @relationship.save
---
INSERT INTO "relationships" ("user_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["follower_id", 4], ["created_at", "2020-07-17 19:09:25.940198"], ["updated_at", "2020-07-17 19:09:25.940198"]]

  def destroy
    @relationship.destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 5]]

  def set_create_relationship
    @relationship = Relationship.new(user_id: current_user.id, follower_id: params[:follower_id])

    @follower_user = User.find(params[:follower_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def set_destroy_relationship
    @relationship = Relationship.where(user_id: current_user, follower_id: params[:user_id]).first

    @follower_user = User.find(params[:user_id])
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."follower_id" = $2 ORDER BY "relationships"."id" ASC LIMIT $3  [["user_id", 5], ["follower_id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]