app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC
---
  def index
    @tweets = Tweet.order(created_at: :desc)

INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweet", "lalalala"], ["created_at", "2020-07-17 00:51:21.953809"], ["updated_at", "2020-07-17 00:51:21.953809"], ["user_id", 1]]
---
  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save

DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 1]]
---
  def destroy
    @tweet.destroy

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_tweet
      @tweet = Tweet.find(params[:id])